abhijitshirale21-gif/Microcontroller-stm32f4.xx_device_drivers/Src/003led_button.c
/*
 * 001led_toggle.c
 *
 *  Created on: Aug 2, 2026
 *      Author: Acer
 */
#include "stm32f407xx.h"
#define HIGH 1
#define LOW 0
#define BTN_PRESSED_LOW 1

void delay(void)
{
	for(uint32_t i = 0; i < 50000/2; i++);
}
int main(void)
{
	GPIO_Handle_t GpioLed,GpioBtn;

	GpioLed.pGPIOx = GPIOA;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_8;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GpioLed.GPIO_PinConfig.GPIO_PinOpType = GPIO_OP_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClockControl(GPIOA,ENABLE);
	GPIO_Init(&GpioLed);

	GpioBtn.pGPIOx = GPIOB;
		GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
		GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
		GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
		GpioBtn.GPIO_PinConfig.GPIO_PinOpType = GPIO_OP_TYPE_PP;
		GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;

		GPIO_PeriClockControl(GPIOB,ENABLE);
		GPIO_Init(&GpioBtn);


	while(1)
	{
		if(GPIO_ReadFromInputpin(GPIOB,GPIO_PIN_NO_12) == BTN_PRESSED_LOW)
		{
			delay();
		  GPIO_ToggleOutputpin(GPIOA, GPIO_PIN_NO_8);
		}

	}
	return 0;





}
/*
 * 002led_bitton.c
 *
 *  Created on: Aug 6, 2026
 *      Author: Acer
 */


/*
 * 003led_button.c
 *
 *  Created on: Aug 6, 2026
 *      Author: Acer
 */


